# 商业模型
m1 = {'_id': 'm1', 'fx': 'cny', 'sys': 'e',
      'date': '2018-12',
      'm000000': 6,  # 公司成立年限（年）
      'm000001': 6,  # 公司持续经营年限（年）
      'm000002': '上海市',  # 公司总部所在地
      'm000003': 10000000,  # 公司注册资本
      'm00000301': 5000000,  # 公司实缴资本
      'm00000302': 0.2,  # 公司非货币出资占比
      'm00000403': '设计、生产、销售软件',  # 公司主营业务描述
      'm00000404': ['软件', '人工智能', '互联网'],  # 公司概念标签
      'm000005': 1,  # 公司性质
      'm00000501': 0.91,  # 实控人及一致行动人控股比例
      'm010000': 1,  # 企业家出身类型
      'm010001': 8,  # 企业家的管理经验（年）
      'm010002': 12,  # 企业家的行业经验（年）
      'm010101': 5,  # 除企业家外主要合伙人/高管平均管理经验（年）
      'm01010101': 7,  # 除企业家外主要高管平均行业经验（年）
      'm01010703': [0, 2],  # 公司招募高管或合伙人看重的因素
      'm010108': 3000000,  # 除企业家外主要高管总年薪（人民币元）
      'm010109': 0.05,  # 除企业家外主要合伙人/高管持股比例
      'm020200': 25,  # 全职员工总人数（人）
      'm02020102': 2,  # 全职员工在本公司平均任职年限
      'm020204': 3,  # 员工最近1年平均接受岗位培训时间（天）
      'm02020601': 2,  # 员工晋升制度完善度
      'm02020602': 2,  # 员工晋升制度执行情况
      'm02020701': 30,  # 未来1年计划招聘员工数（人）
      'm02020702': 5,  # 未来1年计划解聘员工数（人）
      'm02020703': [1, 2, 4],  # 公司招聘人才看重的因素
      'm020208': 1,  # 员工薪资与同行企业相比
      'm02020801': 0.2,  # 员工薪酬中年终奖金平均占比
      'm02020802': 0.1,  # 公司平均销售佣金比例（按销售额）
      'm020209': 0.15,  # 员工期权池比例
      'm02020901': 0.1,  # 员工期权池剩余比例
      'm020300': 4,  # 行政和管理人员总数（人）
      'm020400': 16,  # 市场和销售人员总数（人）
      'm020500': 3,  # 技术和研发人员总数（人）
      'm020600': 0,  # 生产和服务人员总数（人）
      'm030000': 0,  # 公司战略制定者
      'm030001': 1,  # 公司竞争战略
      'm030002': [0, 1, 2],  # 行业主要壁垒
      'm030003': 2,  # 产业链地位
      'm030004': [4, 6, 7],  # 外包业务环节
      'm030005': [0, 2, 3],  # 企业拥有资质
      'm030006': 4,  # 业务覆盖地域
      'm030100': 1,  # 您的企业文化类型是
      'm030101': 3,  # 您认为企业文化应达到的效果是
      'm040000': 3,  # 公司的研发性质
      'm040001': 0.2,  # 专利实施率
      'm040002': 0.1,  # 研发支出占总支出比例
      'm040101': 12,  # 已授权有效发明专利数量
      'm04010101': 3,  # 最近1年申请发明专利数量
      'm04010102': 12,  # 已授权有效发明专利平均保护期限
      'm040102': 20,  # 已授权有效实用新型数量
      'm04010201': 6,  # 最近1年申请实用新型数量
      'm040103': 18,  # 已授权有效软件著作权数量
      'm04010301': 3,  # 最近1年申请软件著作权数量
      'm040104': 0,  # 已授权有效外观设计专利数量
      'm040105': 0,  # 已授权有效作品著作权数量
      'm040106': 1,  # 已注册有效商标数量
      'm04010701': 2,  # 最近1年发表的期刊论文、会议论文和学术专著数量
      'm040200': 5,  # 技术和研发人员平均工作年限（年）
      'm040201': 9,  # 技术和研发人员平均行业经验（年）
      'm040202': 0.3,  # 技术和研发人员拥有硕士学位者占比
      'm040203': 0.05,  # 技术和研发人员拥有博士学位者占比
      'm040204': 0.2,  # 技术和研发人员拥有海外背景者占比
      'm050000': 200,  # 主营产品类型
      'm050001': '略',  # 主营产品描述
      'm050002': 1,  # 主营产品是否新兴
      'm050100': 1500000000,  # 主营产品市场需求（人民币元）
      'm050101': 3,  # 主营产品市场翻番预计年限
      'm050102': 13,  # 主营产品最快退出市场年限
      'm050200': 0.052,  # 本公司主营产品市场占有率
      'm050201': 2,  # 本公司主营产品市场竞争力
      'm050202': 1,  # 主营产品市场竞争格局
      'm050203': 1,  # 主营产品替代品情况
      'm050300': [1, 5, 8],  # 收入形式
      'm050301': [0, 6, 8],  # 销售渠道
      'm050400': 0.31,  # 来源于前五大客户的收入占营业收入比例
      'm050402': 0.05,  # 企业关联交易占总收入比例
      'm050500': 0,  # 主要主营业务成本类型
      'm050501': 0.15,  # 销售费用占总支出比例
      'm050502': 0.03,  # 固定资产投资占总支出比例
      'm050600': 0.62,  # 支付给前五大供应商的成本占总成本比例
      'm060000': 0,  # 融资轮次
      'm060001': 0,  # 融资市场
      'm060100': 0,  # 机构投资者持股占比
      'm060101': 10000000000,  # 机构投资者最大资管规模（人民币元）
      'm060102': 0.25,  # 机构投资者派驻董事占总席位比例
      'm060200': 2,  # 预计退出方式
      'm060201': 5,  # 预计退出时间（年）
      'm060202': 800000000,  # 预计退出时年销售额
      'm060203': 20000000,  # 预计退出时年净利润
      'm060300': 1000000000,  # 预计退出前累计需融资金额
      'm070000': 0.8,  # 公司运转负荷
      'm070001': 1,  # 公司资金链状况
      'm070100': 0.05,  # 最近1年信息化支出占总成本比例
      'm070101': 1,  # 是否有专职IT经理
      'm070102': [0, 2, 6],  # 已拥有的软件系统
      'm070200': [0],  # 企业内部是否设有以下职能部门
      'm070201': 2,  # 企业审批流程体系
      'm070202': 1,  # 企业跨部门协作制度
      'm070300': 2,  # 拥有子公司、分公司或分支机构数量
      'm0800000': 0,  # 企业是否曾受监管机构处罚
      'm080100': 18,  # 企业发起诉讼次数
      'm080101': 29,  # 企业遭到起诉次数
      'm080102': 0,  # 企业被执行次数
      'm080200': 10000000,  # 银行授信额
      'm080201': 0.12,  # 银行授信利率
      'm080203': 0,  # 最近1年债务违约额
      'm090000': 0,  # 行业景气程度
      'm090001': 2,  # 预计行业景气度趋势
      'm090100': 0.01,  # 政府补助占总收入比例
      'm090101': 1,  # 是否受惠于企业帮扶政策
      'm090102': 0,  # 是否有政府引导基金支持
      'm090200': 0,  # 主营业务是否产生环境污染
      'm090201': 0,  # 主营业务是否违背社会公众道德
      'm100000': 0,  # 海外全职员工人数（人）
      'm100100': 0.18,  # 收入中出口占比
      'm100101': 0.06,  # 出口平均关税
      'm100200': 0.24,  # 成本中进口占比
      'm100201': 0.1,  # 进口平均关税
      }

# 资产负债表
b1621 = {'_id': 'b1621', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'date': '2018-12',
         'e0001': 141960.25,
         'e0022': 223319.15,
         'e0031': 173881.22,
         'e0112': 593810.01,
         'e0s': 1468821.10,
         'e1001': 200000.00,
         'e1022': 53991.82,
         'e1s': 298371.30,
         'e2001': 500000.00}

b1622 = {'_id': 'b1622', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'date': '2017-12',
         'e0001': 217193.99,
         'e0022': 153918.28,
         'e0031': 133817.20,
         'e0112': 624711.37,
         'e0s': 1355882.60,
         'e1001': 200000.00,
         'e1022': 40788.92,
         'e1s': 311200.21,
         'e2001': 500000.00}

b1623 = {'_id': 'b1623', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'date': '2016-12',
         'e0001': 161141.20,
         'e0022': 198201.44,
         'e0031': 151182.31,
         'e0112': 641912.08,
         'e0s': 1309811.87,
         'e1001': 200000.00,
         'e1022': 43641.12,
         'e1s': 253089.66,
         'e2001': 500000.00}

b1624 = {'_id': 'b1624', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'date': '2015-12',
         'e0001': 115632.67,
         'e0022': 168781.28,
         'e0031': 138771.19,
         'e0112': 638816.29,
         'e0s': 1377619.52,
         'e1001': 200000.00,
         'e1022': 40081.17,
         'e1s': 257182.27,
         'e2001': 500000.00}

# 利润表
f1590 = {'_id': 'f1590', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'since': '2018-07', 'date': '2018-12',
         'e3101': 1233315.28,
         'e3201': -783712.16,
         'e321202': -3810.00,
         'e35': -23931.02,
         'e35s1': 87121.41,
         }

f1591 = {'_id': 'f1591', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'since': '2018-01', 'date': '2018-06',
         'e3101': 1419252.72,
         'e3201': -819523.33,
         'e321201': 0,
         'e321202': -4400.00,
         'e35': -14881.19,
         'e35s1': 37022.44,
         }

f1592 = {'_id': 'f1592', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'since': '2017-10', 'date': '2017-12',
         'e3101': 648871.10,
         'e3201': -399810.01,
         'e321202': -3100.00,
         'e321301': 0,
         'e35': -12991.92,
         'e35s1': 34881.14,
         }

f1593 = {'_id': 'f1593', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'since': '2017-07', 'date': '2017-12',
         'e3101': 1099281.34,
         'e3201': -820119.25,
         'e321202': -3280.00,
         'e35': -3918.88,
         'e35s1': 19981.58,
         }

f1594 = {'_id': 'f1594', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'since': '2017-01', 'date': '2017-03',
         'e3101': 577132.21,
         'e3201': -404181.67,
         'e321202': -0.0,
         'e35': -11992.92,
         'e35s1': -1992.59,
         }

f1595 = {'_id': 'f1595', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'since': '2016-01', 'date': '2016-12',
         'e3101': 1845315.30,
         'e3201': -1645800.08,
         'e321202': -0.0,
         'e35': -24819.06,
         'e35s1': 97283.56,
         }

f1596 = {'_id': 'f1596', 'fx': 'cny', 'gaap': 'cn', 'sys': 'e',
         'since': '2016-01', 'date': '2016-03',
         'e3101': 382172.15,
         'e3201': -257033.81,
         'e321202': -0.0,
         'e35': -14102.01,
         'e35s1': 45291.32,
         }

h1 = {'_id': 'h1', 'fx': 'cny', 'sys': 'e',
      'date': '2018-12',
      'capr': 0.037,
      'kd': 0.08}


if __name__ == '__main__':
    import Env
    import pandas as pd
    from Data.ConnDB import ConnRm as MongoRdt
    from Config.DB import *

    pd.set_option('display.max_columns', None)
    pd.set_option('display.max_rows', None)
    bm = pd.DataFrame([m1])
    bal = pd.DataFrame([b1621, b1622, b1623, b1624])
    flow = pd.DataFrame([f1590, f1591, f1592, f1593, f1594, f1595, f1596])
    hypo = pd.DataFrame([h1])

    Env.set_env('test')
    with MongoRdt(Database.rdt) as conn:
        conn.remove_id('Business', 'm1')
        conn.remove_id('Bal', ['b1621', 'b1622', 'b1623', 'b1624'])
        conn.remove_id('Flow', ['f1590', 'f1591', 'f1592', 'f1593', 'f1594', 'f1595', 'f1596'])
        conn.remove_id('Hypothesis', 'h1')

        conn.save('Business', bm)
        conn.save('Bal', bal)
        conn.save('Flow', flow)
        conn.save('Hypothesis', hypo)

        bm_data = conn.find_one('Business', {'_id': 'm1'})
        bal_data = conn.find('Bal', {'_id': {'$in': ['b1621', 'b1622', 'b1623', 'b1624']}})
        flow_data = conn.find('Flow', {'_id': {'$in': ['f1590', 'f1591', 'f1592', 'f1593', 'f1594', 'f1595', 'f1596']}})
        hypo_data = conn.find_one('Hypothesis', {'_id': 'h1'})

        print(bm_data)
        print(bal_data)
        print(flow_data)
        print(hypo_data)

        bal_dict = bal_data.to_dict('record')
        print(bal_dict)
